/*
 * 자바 = 기본과정  -> 소스 분석
 *        변수 / 데이터형 / 연사자 / 제어문 / 배열 -> 순서 / 연산처리
 *     = 객체지향
 *        클래스 / 객체 / 메소드 / 생성자 / 인터페이스 / 추상클래스
 *        -> 캡슐화 / 은닉화 / 상속 / 다형성
 *        -> SOLID -> 개념
 *     = 예외처리
 *        프로그램 종료없이 수행이 가능
 *     ------------------------------------1권
 *     = 라이브러리 : 지정된 것 암기
 *       = 데이터 저장 : Collection
 *       = 파일 입출력 : IO
 *       = 오라클 연동 : JDBC
 *       ------------필수
 *       = 기타 : 쓰레드, 네트워크
 *  
 *    1. 순서
 *        = 사용자가 보내준 데이터를 저장 : 메모리 저장 => 변수
          = 요청 처리 => 제어문 / 연산자
             메소드(함수) -> 다음 필요시 재사용
          = 결과값을 출력 => IO
          2. 변수 : 메모리 공간의 이름 
 */   

public class 과정소개 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
